reddit-clone/app/views/posts/edit.html.erb

SELECT "subs".* FROM "subs"
SELECT "subs"."id" FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1  [["post_id", 1]]
---
<% subs = Sub.all %>
<% subs_with_post = @post.subs.pluck(:id) %>