reddit-clone/app/views/posts/new.html.erb

<% subs = Sub.all %>
---
SELECT "subs".* FROM "subs"