reddit-clone/app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "qwerty"], ["LIMIT", 1]]
---
    def self.find_by_credentials(username, password)
        user = User.find_by(username: username)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2022-11-18 18:37:24.188601"], ["id", 1]]
---
    def reset_session_token!
        self.session_token = generate_unique_session_token
        self.save!

SELECT 1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]
---
    def generate_unique_session_token
        while true
            token = SecureRandom::urlsafe_base64
            return token if !User.exists?(session_token: token)