reddit-clone/app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "author_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "askjhaskdjh"], ["author_id", 1], ["post_id", 1], ["created_at", "2022-11-18 23:12:26.306398"], ["updated_at", "2022-11-18 23:12:26.306398"]]
---
    def create
        @comment = Comment.new(comment_params)
        @comment.author_id = current_user.id
        @comment.post_id = params[:post_id]

        if @comment.save