reddit-clone/app/controllers/posts_controller.rb

INSERT INTO "post_subs" ("sub_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["sub_id", 1], ["post_id", 1], ["created_at", "2022-11-18 23:03:35.221682"], ["updated_at", "2022-11-18 23:03:35.221682"]]
---
    def create
        @post = Post.new(post_params)
        @post.author_id = current_user.id
        @post.sub_id = params[:sub_id]

        if @post.save