reddit-clone/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "plz work 3"], ["description", ""], ["moderator_id", 1], ["created_at", "2022-11-18 19:20:19.744577"], ["updated_at", "2022-11-18 19:20:19.744577"]]
---
    def create
        @sub = Sub.new(sub_params)
        @sub.moderator_id = current_user.id
        if @sub.save

SELECT "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @sub = Sub.find_by(id: params[:id])

SELECT "subs".* FROM "subs"
---
    def index
        @subs = Sub.all